In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [4]:
s

a   -1.498691
b   -0.620556
c   -0.926866
d    0.892459
e    1.291624
dtype: float64

In [10]:
s[[0,4,3,1]]

a   -1.498691
e    1.291624
d    0.892459
b   -0.620556
dtype: float64

In [5]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [6]:
d = {'a' : 0., 'b' : 1., 'c' : 2.}

In [11]:
 df2 = pd.DataFrame(np.random.randint(low=0, high=10, size=(5, 5)),
                    columns=['a', 'b', 'c', 'd', 'e'])

In [12]:
df2

   a  b  c  d  e
0  8  9  5  9  3
1  5  3  8  5  5
2  5  4  6  1  7
3  1  8  4  6  4
4  4  0  4  2  5

In [14]:
df2.aggregate

<bound method DataFrame.aggregate of    a  b  c  d  e
0  8  9  5  9  3
1  5  3  8  5  5
2  5  4  6  1  7
3  1  8  4  6  4
4  4  0  4  2  5>

In [16]:
df2.tail(3)

   a  b  c  d  e
2  5  4  6  1  7
3  1  8  4  6  4
4  4  0  4  2  5

In [17]:
df2.index

RangeIndex(start=0, stop=5, step=1)

In [18]:
df2.columns

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [19]:
df2.values

array([[8, 9, 5, 9, 3],
       [5, 3, 8, 5, 5],
       [5, 4, 6, 1, 7],
       [1, 8, 4, 6, 4],
       [4, 0, 4, 2, 5]])

In [20]:
df2.describe()

             a         b        c         d        e
count  5.00000  5.000000  5.00000  5.000000  5.00000
mean   4.60000  4.800000  5.40000  4.600000  4.80000
std    2.50998  3.701351  1.67332  3.209361  1.48324
min    1.00000  0.000000  4.00000  1.000000  3.00000
25%    4.00000  3.000000  4.00000  2.000000  4.00000
50%    5.00000  4.000000  5.00000  5.000000  5.00000
75%    5.00000  8.000000  6.00000  6.000000  5.00000
max    8.00000  9.000000  8.00000  9.000000  7.00000

In [21]:
df2.T

   0  1  2  3  4
a  8  5  5  1  4
b  9  3  4  8  0
c  5  8  6  4  4
d  9  5  1  6  2
e  3  5  7  4  5

In [22]:
df2.describe()

             a         b        c         d        e
count  5.00000  5.000000  5.00000  5.000000  5.00000
mean   4.60000  4.800000  5.40000  4.600000  4.80000
std    2.50998  3.701351  1.67332  3.209361  1.48324
min    1.00000  0.000000  4.00000  1.000000  3.00000
25%    4.00000  3.000000  4.00000  2.000000  4.00000
50%    5.00000  4.000000  5.00000  5.000000  5.00000
75%    5.00000  8.000000  6.00000  6.000000  5.00000
max    8.00000  9.000000  8.00000  9.000000  7.00000

In [23]:
df=df2

this is a markdown

In [39]:
df

   a  b  c  d  e
0  8  9  5  9  3
1  5  3  8  5  5
2  5  4  6  1  7
3  1  8  4  6  4
4  4  0  4  2  5

In [36]:
df.loc[1]

a    5
b    3
c    8
d    5
e    5
Name: 1, dtype: int32

In [38]:
df.loc[:,['b']]

   b
0  9
1  3
2  4
3  8
4  0

In [40]:
df.loc[2:3,['a','b']]

   a  b
2  5  4
3  1  8

In [9]:
data = {"feature_one" :[1,2,4,8,-3],
       "feature_two" : ["haight", "mission", "geary", "castro", " potrero"],
       "feature_three": [True, True, False, True, False]}
df = pd.DataFrame(data, index=[6,7,8,9,10])

df

   feature_one  feature_three feature_two
0            1           True      haight
1            2           True     mission
2            4          False       geary
3            8           True      castro
4           -3          False     potrero

In [5]:
d2=df[['feature_one','feature_two','feature_three']]

In [6]:
d2

    feature_one feature_two  feature_three
6             1      haight           True
7             2     mission           True
8             4       geary          False
9             8      castro           True
10           -3     potrero          False

In [10]:
l = [3,2,6,7,9,1,2,-5]

array = np.array(l)

In [11]:
a2 = np.arange(16).reshape(4,4)
a2

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [19]:
a2[1,2]

6

In [20]:
a2[2:,:3]

array([[ 8,  9, 10],
       [12, 13, 14]])

In [26]:
a2[2:,3:]

array([[11],
       [15]])

In [24]:
a2[:1]

array([[0, 1, 2, 3]])

In [27]:
df.columns

Index(['feature_one', 'feature_three', 'feature_two'], dtype='object')

In [28]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [29]:
df.values

array([[1, True, 'haight'],
       [2, True, 'mission'],
       [4, False, 'geary'],
       [8, True, 'castro'],
       [-3, False, ' potrero']], dtype=object)

In [30]:
df

   feature_one  feature_three feature_two
0            1           True      haight
1            2           True     mission
2            4          False       geary
3            8           True      castro
4           -3          False     potrero

In [35]:
 dates = pd.date_range('20170101', periods=6)

In [36]:
dates

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06'],
              dtype='datetime64[ns]', freq='D')

In [38]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

df


df.T

df.sort_index(axis=1, ascending=False)

In [47]:
df[df>0]

                   A         B         C        D
2017-01-01       NaN  1.623144       NaN      NaN
2017-01-02  0.822848       NaN  0.254905      NaN
2017-01-03  0.300649  0.465771  1.980219  0.75131
2017-01-04  1.070780       NaN       NaN      NaN
2017-01-05  1.952488  0.613833  0.597883      NaN
2017-01-06  0.524847  1.231381  0.247506  0.66820